-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: book
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `ISBN` bigint NOT NULL,
  `BookName` varchar(80) NOT NULL,
  `Author` varchar(60) NOT NULL,
  `Type` varchar(45) NOT NULL,
  `Language` varchar(45) NOT NULL,
  `Publish` varchar(45) NOT NULL,
  `PublishDate` date NOT NULL,
  `Price` int NOT NULL,
  `OnSale` int NOT NULL,
  `Invertory` int NOT NULL,
  `bookscontent` varchar(300) NOT NULL,
  PRIMARY KEY (`ISBN`,`BookName`,`Author`,`Type`,`Language`,`Publish`,`PublishDate`,`Price`,`OnSale`,`Invertory`,`bookscontent`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (789861798165,'今天，我只想演自己','鍾欣凌','心理勵志','繁體中文','大田','2023-12-01',350,276,10,'管他雨天晴天陰天，那些過不去的某一天總會過去，最終學會撥撥頭髮，繼續往前！'),(4713375690955,'潛水：深海的記憶','단요','文學小說','繁體中文','大樹林 ','2023-10-05',350,276,10,'讓長大的我們忍不住流下淚，逝去的少女以機器人身分重生，告訴我們如何與內心傷痕和解……'),(9786263104853,'第一次的親密接觸','蔡智恆','愛情小說','繁體中文','麥田','2023-12-02',420,331,10,'一場最美麗的網路邂逅，當痞子蔡遇見輕舞飛揚……大學校園裡最經典的純愛故事，網路上瘋狂轉載的熱門小說25年後，時光再回轉，跟著蔡智恆回到那個網路尚未普及的年代在信件的字裡行間，刻劃著老派的浪漫、質樸的愛戀，以及最單純真摯的情感PH值小於7的微酸心情，25年後，讓痞子蔡繼續告訴你……'),(9786263144996,'夜裡的花香','Leïla Slimani','文學小說','繁體中文','木馬文化','2023-06-28',750,592,10,'「妳願意，被關在博物館裡一個晚上嗎？」獨自在博物館赤腳漫步一夜從他人的藝術品，看見自我的創作真諦理解創作就是開闢出自己的自由之地'),(9786263153394,'巴別塔學院','R.F. Kuang','文學小說','繁體中文','臉譜','2023-07-29',599,473,10,'封獻給異國語言與文字的情書，也是一份反叛帝國霸權的開戰宣言'),(9786263523647,'縫隙','逢時','文學小說','繁體中文','台灣角川','2023-03-15',300,270,10,'她早就不再與人談論女兒，也不再懷抱希望，但為什麼在這個拼湊著各宗教脈絡而生的畸型信仰之下，她仍然潸然淚下，是不是因為把她們凝聚在這裡的，都是做母親心底最深的自責與恐懼？'),(9786263743366,'皮拉奈奇','Susanna Clarke','文學小說','繁體中文','時報出版','2023-10-03',400,316,10,'人生再脆弱，也值得一場迷宮中的冒險。'),(9786263791190,'晚安是你，明天的早安也要是你','青','心理勵志','繁體中文','台灣東販','2023-11-29',380,300,10,'用真誠的文字寫下自己沉浸在戀愛裡的故事溫暖每個渴望愛情又怕受傷害的人們遇見你，世界變得如此可愛'),(9786267212288,'偏見的本質','Gordon Allport ','心理勵志','繁體中文','一起來出版 ','2023-11-08',750,592,10,'我們築起圍牆，是為了保護自己珍視的東西。大師深入解析偏見的根源、影響，以及解決之道一部教你判斷「真實」的寶典'),(9786267212301,'選擇的弔詭','Barry Schwartz','心理勵志','繁體中文','一起來出版 ','2023-11-29',420,331,10,'人生四千個禮拜，不夠我們每次都做出漂亮的選擇。關鍵四堂心理學，讓選擇變簡單'),(9786267217009,'別來無恙【紀念版】',' 晨羽','愛情小說','繁體中文','城邦原創','2022-10-29',380,300,10,'一起重溫最初的心痛與感動好希望治癒你傷口的解藥，不是時間和距離——而是我。'),(9786267313671,'人類圖天賦使用說明書','Jenna Zoe','心理勵志','繁體中文','橡實文化 ','2023-11-08',580,522,10,'天賦加上熱情，等於完美的人生找出你的天賦，並將其最優化不需專研也能立刻受用的人類圖自學手冊'),(9786269591350,'男神，你等等','米琳','愛情小說','繁體中文','城邦原創','2024-01-11',330,297,10,'高冷腹黑男神Ｘ母胎單身系花我渴望的，是看見了我真實的一面之後，依然願意為我停留的你……'),(9786269593842,'不便利的便利店','김호연','文學小說','繁體中文','寂寞','2022-09-01',400,316,10,'人生就是會有很多不便利、不舒服，這間有點慘澹的便利店，卻為我們撐起了閃閃發光的空間……艱難時刻的光亮之書一間便利店，接通了我們的幸福人生'),(9786269598779,'自我植癒的每一天','金銀珠','心理勵志','繁體中文','拾青文化 ','2023-04-19',480,336,10,'自我植癒＝植栽＋澆灌＋治癒啟動自我植癒日日小練習打造出獨一無二的美麗植物——我 自 己每一天，都能發現自己變得更好、更Chill、更可愛一點點！'),(9786269657032,'幀破：慾望攝獵',' 夜透紫','文學小說','繁體中文','凌宇','2022-09-20',380,300,10,'為主奉獻的窮苦神學生，居住在黃金地段的鑽石單身漢，看似八竿子打不著的兩人忽然成為「主僱」，原以為工作內容只是整理家務、遛遛狗，沒想到還包括不定時發出的救命任務！'),(9787513338387,'灰馬酒店','阿加莎·克里斯蒂','懸疑推理小說','簡體中文','新星出版社','2022-12-01',252,219,10,'年長牧師在聽取了一位女病人的臨終懺悔后被殺，警方從他身上發現了一張神秘的名單，並發現名單上的人都已去世，死於各種不同的疾病。這一切似乎都指向一個叫灰馬酒店的地方，那裡的三個女巫聲稱可以用魔法令人自然死亡。不信邪的伊斯特布魯克先生決定親自試一試，很快，他最擔心的事情就發生了……'),(9787513338400,'命運之門','阿加莎·克里斯蒂','懸疑推理小說','簡體中文','新星出版社','2022-12-01',252,219,10,'已屆老年的主人公湯米和塔彭絲夫婦在一座老宅子裏發現了一樁塵封多年的案件，通過不懈努力，終於使案情水落石出。'),(9787513344876,'天使的號角','傑夫里·迪弗','懸疑推理小說','簡體中文','新星出版社','2022-12-01',414,360,10,'兇手的下一個攻擊目標是誰？受害者的神秘刺青傳遞了什麼信息？兇手自己的刺青——一張長着女人臉和獠牙的猙獰蜈蚣又有何深意？他的終極任務到底是什麼？隨着調查的深入，萊姆愈發覺得，沒有什麼比陰魂不散的過往更讓人瘋狂……'),(9787513350440,'祈禱之海','格雷格·伊根','科幻奇幻小說','簡體中文','新星出版社','2023-01-01',348,303,10,'人的內在和外部世界一樣是可以用自然科學認知的，觀念、人格、記憶甚至愛都能從物理學深處找到解釋。我們能夠認知一切，只要我們足夠勇敢。'),(9787513350457,'閃耀','陳梓鈞','科幻奇幻小說','簡體中文','新星出版社','2023-01-01',354,308,10,'“太空大航海時代”對遠方的嚮往以及人類在大災難時以科技自救的悲壯抗爭，風格澎湃、肆意、雄渾，充滿理想主義激情與技術的浪漫。'),(9787513352581,'怪獸保護協會','約翰·斯卡爾齊','科幻奇幻小說','簡體中文','新星出版社','2023-10-01',354,308,10,'當我來到一個蓊蓊鬱郁的格陵蘭島，看到小山大小、自成生態系統的奇怪生物漫步在一個沒有人類踏足的大地上，我產生了一種不祥的預感。'),(9787514621518,'同溫層食堂','汪彥中','科幻奇幻小說','簡體中文','中國畫報出版社','2023-04-01',270,235,10,'超過一百二十萬人離開地面，就這麼十幾年、幾十年孤獨地漂浮在同溫層中，他們害怕孤獨，也想念親人，但在同溫層存在的食堂卻能夠給他們快樂……'),(9787514621532,'天地大衝撞','蕭星寒','科幻奇幻小說','簡體中文','中國畫報出版社','2023-04-01',270,235,10,'科技對人性的考驗，帶入讀者深入思考科技對人類、生活帶來的負面影響。'),(9787532967155,'天才與瘋子的狂想','南派三叔','懸疑推理小說','簡體中文','山東文藝出版社','2023-01-01',348,303,10,'“地球是一把鎖”“人體是黑盒子”“有一個外星人在我的腦子裡”，“影子有1829層”“疼痛有14種感覺”，天馬行空、奇思異想，從量子物理到生命存在，為我們呈現了不同角度的世界。'),(9787541162701,'五十分之一','宇航一','懸疑推理小說','簡體中文','四川文藝出版社','2022-11-01',288,251,10,'以杭一為首的幾個同伴聯合起來，希望可以說服超能力者們通力合作，解決問題。然而，死亡遊戲已經開始，背後操控的人不會輕易妥協。'),(9787541166976,'春日偶成','橋上小菩','愛情小說','簡體中文','四川文藝出版社','2023-08-01',257,224,10,'即使荊棘圍困我的城堡，即使女巫使用咒語要我沉睡，即使既定的命運要我遺忘你……可是，如果你呼喚我，我仍會出現。哪怕只有千千萬萬億億分之一的概率，我也會與你，再次相見。'),(9787545572728,'破夜（上下）','北流','懸疑推理小說','簡體中文','天地出版社','2023-03-01',468,407,10,'冷漠理智、不近人情的高智商犯罪顧問秦晉荀，背負著原生家庭的陰影，為了探究一樁陳年舊事來到諸城，結識了滿身都是秘密的女主角溫玉。'),(9787557029128,'危險關係','白雲孤扉','懸疑推理小說','簡體中文','廣東旅遊出版社','2023-01-01',330,287,10,'床笫之間的第三雙眼睛，慘死家中的恩愛夫妻，心懷不軌的猥瑣鄰居，爛尾樓中的懷孕女屍……錯綜複雜的案件關係，意料之外的犯罪動機。熱血女警穆錦和冷面學霸商洛白，“同居”密友攜手勘破重重迷案，解鎖未知危險關係！'),(9787557031411,'浪漫過敏','偷馬頭','愛情小說','簡體中文','廣東旅遊出版社','2023-11-01',257,224,10,'是誰跨越南北，說去看雪，只為看她？漫天煙花炸響，卻把未盡的告白淹沒……相比不切實際的愛情，安念念更相信自己。'),(9787559479037,'今朝渡‧下冊','日日複日日','愛情小說','簡體中文','江蘇鳳凰文藝出版社','2023-10-01',281,281,10,'受天威壓迫千年，他早習以為常。直到遇到聶音之。他願意用命賭一把，打破天道規則，去好好愛她。'),(9787559637949,'盜墓筆記十年','南派三叔','懸疑推理小說','簡體中文','北京聯合出版公司','2019-11-01',276,240,10,'隱秘的七星魯王宮、海底沉船墓，詭異的秦嶺神樹、雲頂天宮，神秘莫測的蛇沼鬼城、陰山古樓，再加上可怖的血屍、駭人的禁婆、要命的奇門遁甲機關陣圖，時時讓人置身險境！'),(9787559664228,'未完成的手稿','弗蘭克·蒂利耶','懸疑推理小說','簡體中文','北京聯合出版公司','2022-10-01',408,355,10,'一具沒有臉的屍體，一部未完成的手稿。法國格勒諾布爾市，一輛汽車在午夜墜入峽谷，後備箱里有一具女屍：整張臉都被撕掉了。四年前，暢銷書女作家琳妮十七歲的女兒突然失蹤；如今丈夫意外失憶，一直苦苦追尋真相的她瀕臨崩潰，而警察一路的抽絲剝繭帶給她的卻是步步殺機……'),(9787559664389,'漫長的寒冬：失落之城','A.G.利德爾','科幻奇幻小說','簡體中文','北京聯合出版公司','2023-02-21',348,303,10,'失蹤的移民、地底的巨型球體、神秘的圖形，它們與網格有何關係？留給人類的時間不多了，末日之戰，一觸即發，宇宙將復歸寂滅，還是重煥生機？'),(9787559666482,'遺忘效應','喬·哈特','科幻奇幻小說','簡體中文','北京聯合出版公司','2023-05-23',354,308,10,'在猶如密室的太空船上，他人的惡意，自己的心魔，哪個更可怕？當所有證據都指向你是凶手，這是他人的陰謀，還是真實的衝動？'),(9787569947441,'銀翼殺手2029（1）：重逢','邁克·約翰遜','科幻奇幻小說','簡體中文','北京時代華文書局','2023-05-01',348,303,10,'當阿什娜與昔日對手，一個被認為已經死去很久的敵人重逢，她被捲入了一場致命的貓捉老鼠的遊戲。這個複製人與她之前遇到過的全都不同——一名不懼怕死亡的複製人，夢想着創造一個新世界……'),(9787572600531,'暗影巡空','阿拉斯泰爾·雷諾茲','科幻奇幻小說','簡體中文','湖南文藝出版社','2023-05-01',408,335,10,'被詛咒的船隻、復仇的公司和外星文明，大膽的逃亡和超出想象的財富，以及痴迷和背叛。'),(9787572603051,'可愛過敏原','稚楚','愛情小說','簡體中文','湖南文藝出版社','2023-09-01',317,276,10,'只有樂知時是命定之外的意外造訪，是驟雨突至。'),(9787573503053,'白鳥與蝙蝠','東野圭吾','懸疑推理小說','簡體中文','南海出版公司','2023-02-22',414,360,10,'善與惡，是與非，罪與罰，邏輯與感性……一切看似對立不相容的事物，在巨大的命運齒輪面前立場反轉，陰陽顛倒，終於合二為一。“光影共存，晝夜同生，宛如白鳥與蝙蝠在空中對舞。'),(9787573611116,'阿南','Twentine','愛情小說','簡體中文','青島出版社','2023-09-01',299,299,10,'縱情者的一生，大夢一場。兩個一無所有、沒有退路的人，跨越貴州、北京，義無反顧地相愛。'),(9787576316629,'星際邊境','喬·霍爾德曼','科幻奇幻小說','簡體中文','北京理工大學出版社','2022-11-01',299,260,10,'卡梅倫花了六年時間乘坐飛船到了一個遙遠的恒星星系，那裡是某個神秘而強大的外星種族的家。卡梅倫希望與對方達成共識以避免戰爭！'),(9789570871500,'人生不能照單全收，買東西也是','南仁淑','心理勵志','繁體中文','聯經出版公司 ','2023-11-30',360,284,10,'真正的消費是，愉快拿金錢交換人生所需的物品，卻不會被支配！'),(9789573340997,'初戀販賣所',' Misa ','愛情小說','繁體中文','黃冠','2024-01-08',320,288,10,'最深的眷戀，全是想念。最美的愛情，都是錯過。蟬聯博客來、金石堂、誠品暢銷排行榜，純戀教主Misa獻給每一個難忘戀情的妳！'),(9789576587047,'好好再見 不負遇見','黃山料','愛情小說','繁體中文','三采','2021-12-30',380,300,10,'在愛裡傷心，不一定是捨不得對方；我們只是，心疼那個受傷失望的自己。即使不能在一起，遇見你，仍是生命裡最好的事情。'),(9789577417800,'愛，或另一種愛','橘子','文學小說','繁體中文','春天出版社','2023-12-01',310,244,10,'大人不可能什麼都要。寂寞大人世界裡的寂寞是這樣:和條件對的人生活著，和把心給了的人錯過了。'),(9789861344812,'罪行','Ferdinand von Schirach','文學小說','繁體中文','先覺','2023-12-01',330,260,10,'很少有人會在早上起床的時候說：「好吧，我今天要犯罪。」但是，每個人都可能犯下罪行。'),(9789861757667,'我，刀槍不入',' David Goggins','心理勵志','繁體中文','方智','2023-11-01',480,379,10,'一名自幼遭家暴、貧窮、因憂鬱暴飲暴食而肥胖、備受歧視，出生似乎就預告失敗的年輕人，卻勇敢翻轉一切，變身美軍兵王、世界頂尖耐力賽運動員，以及激勵全球讀者的超級偶像，寫下這個世紀最勵志、最感人的生命紀錄。'),(9789865068271,'你的親密關係模式，藏著你過去的傷',' 曾少芬','心理勵志','繁體中文','高寶','2023-09-27',400,316,10,'越愛越無力，不是因為愛消失了，而是你們都受傷了。婚姻不是愛情的墳墓，治療在關係中隱隱作痛的傷疤，愛將在柴米油鹽中繼續生長。婚姻裡的問題，其實是內心舊傷引發的症狀。唯有當過去的傷口癒合，關係才能健康。'),(9789865671297,'小王子','Antoine de Saint-Exupéry','文學小說','繁體中文','漫遊者文化','2014-12-30',250,187,10,'在某次的飛行任務失敗中，偶然的與小王子的邂逅。給每一個曾是孩子的大人……在某次的飛行任務失敗中，偶然的與小王子的邂逅。給每一個曾是孩子的大人……'),(9990867329134,'我可能不完美，但我至少不虛偽','語錄控 ','心理勵志','繁體中文','是日創意文化 ','2023-10-16',480,379,10,'我們從故事裡找到了自己的影子，卻也滋潤了我們被社會傷害的心，我們得到共鳴、得到保有良善以及再度面對的勇氣。＿＿＿獻給在社會黑暗面中，仍負傷前行的你＿＿＿');
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-02 21:19:16
-- MySQL dump 10.13  Distrib 8.0.34, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: morning
-- ------------------------------------------------------
-- Server version	8.0.35

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `books`
--

DROP TABLE IF EXISTS `books`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `books` (
  `ISBN` bigint NOT NULL,
  `BookName` varchar(80) NOT NULL,
  `Author` varchar(60) NOT NULL,
  `Type` varchar(45) NOT NULL,
  `Language` varchar(45) NOT NULL,
  `Publish` varchar(45) NOT NULL,
  `PublishDate` date NOT NULL,
  `Price` int NOT NULL,
  `OnSale` int NOT NULL,
  `Invertory` int NOT NULL,
  `bookscontent` varchar(300) NOT NULL,
  PRIMARY KEY (`ISBN`,`BookName`,`Author`,`Type`,`Language`,`Publish`,`PublishDate`,`Price`,`OnSale`,`bookscontent`,`Invertory`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `books`
--

LOCK TABLES `books` WRITE;
/*!40000 ALTER TABLE `books` DISABLE KEYS */;
INSERT INTO `books` VALUES (789861798165,'今天，我只想演自己','鍾欣凌','心理勵志','繁體中文','大田','2023-12-01',350,276,10,'管他雨天晴天陰天，那些過不去的某一天總會過去，最終學會撥撥頭髮，繼續往前！'),(4713375690955,'潛水：深海的記憶','단요','文學小說','繁體中文','大樹林 ','2023-10-05',350,276,10,'讓長大的我們忍不住流下淚，逝去的少女以機器人身分重生，告訴我們如何與內心傷痕和解……'),(9786263104853,'第一次的親密接觸','蔡智恆','愛情小說','繁體中文','麥田','2023-12-02',420,331,10,'一場最美麗的網路邂逅，當痞子蔡遇見輕舞飛揚……大學校園裡最經典的純愛故事，網路上瘋狂轉載的熱門小說25年後，時光再回轉，跟著蔡智恆回到那個網路尚未普及的年代在信件的字裡行間，刻劃著老派的浪漫、質樸的愛戀，以及最單純真摯的情感PH值小於7的微酸心情，25年後，讓痞子蔡繼續告訴你……'),(9786263144996,'夜裡的花香','Leïla Slimani','文學小說','繁體中文','木馬文化','2023-06-28',750,592,10,'「妳願意，被關在博物館裡一個晚上嗎？」獨自在博物館赤腳漫步一夜從他人的藝術品，看見自我的創作真諦理解創作就是開闢出自己的自由之地'),(9786263153394,'巴別塔學院','R.F. Kuang','文學小說','繁體中文','臉譜','2023-07-29',599,473,10,'封獻給異國語言與文字的情書，也是一份反叛帝國霸權的開戰宣言'),(9786263523647,'縫隙','逢時','文學小說','繁體中文','台灣角川','2023-03-15',300,270,10,'她早就不再與人談論女兒，也不再懷抱希望，但為什麼在這個拼湊著各宗教脈絡而生的畸型信仰之下，她仍然潸然淚下，是不是因為把她們凝聚在這裡的，都是做母親心底最深的自責與恐懼？'),(9786263743366,'皮拉奈奇','Susanna Clarke','文學小說','繁體中文','時報出版','2023-10-03',400,316,10,'人生再脆弱，也值得一場迷宮中的冒險。'),(9786263791190,'晚安是你，明天的早安也要是你','青','心理勵志','繁體中文','台灣東販','2023-11-29',380,300,10,'用真誠的文字寫下自己沉浸在戀愛裡的故事溫暖每個渴望愛情又怕受傷害的人們遇見你，世界變得如此可愛'),(9786267212288,'偏見的本質','Gordon Allport ','心理勵志','繁體中文','一起來出版 ','2023-11-08',750,592,10,'我們築起圍牆，是為了保護自己珍視的東西。大師深入解析偏見的根源、影響，以及解決之道一部教你判斷「真實」的寶典'),(9786267212301,'選擇的弔詭','Barry Schwartz','心理勵志','繁體中文','一起來出版 ','2023-11-29',420,331,10,'人生四千個禮拜，不夠我們每次都做出漂亮的選擇。關鍵四堂心理學，讓選擇變簡單'),(9786267217009,'別來無恙【紀念版】',' 晨羽','愛情小說','繁體中文','城邦原創','2022-10-29',380,300,10,'一起重溫最初的心痛與感動好希望治癒你傷口的解藥，不是時間和距離——而是我。'),(9786267313671,'人類圖天賦使用說明書','Jenna Zoe','心理勵志','繁體中文','橡實文化 ','2023-11-08',580,522,10,'天賦加上熱情，等於完美的人生找出你的天賦，並將其最優化不需專研也能立刻受用的人類圖自學手冊'),(9786269591350,'男神，你等等','米琳','愛情小說','繁體中文','城邦原創','2024-01-11',330,297,10,'高冷腹黑男神Ｘ母胎單身系花我渴望的，是看見了我真實的一面之後，依然願意為我停留的你……'),(9786269593842,'不便利的便利店','김호연','文學小說','繁體中文','寂寞','2022-09-01',400,316,10,'人生就是會有很多不便利、不舒服，這間有點慘澹的便利店，卻為我們撐起了閃閃發光的空間……艱難時刻的光亮之書一間便利店，接通了我們的幸福人生'),(9786269598779,'自我植癒的每一天','金銀珠','心理勵志','繁體中文','拾青文化 ','2023-04-19',480,336,10,'自我植癒＝植栽＋澆灌＋治癒啟動自我植癒日日小練習打造出獨一無二的美麗植物——我 自 己每一天，都能發現自己變得更好、更Chill、更可愛一點點！'),(9786269657032,'幀破：慾望攝獵',' 夜透紫','文學小說','繁體中文','凌宇','2022-09-20',380,300,10,'為主奉獻的窮苦神學生，居住在黃金地段的鑽石單身漢，看似八竿子打不著的兩人忽然成為「主僱」，原以為工作內容只是整理家務、遛遛狗，沒想到還包括不定時發出的救命任務！'),(9787513338387,'灰馬酒店','阿加莎·克里斯蒂','懸疑推理小說','簡體中文','新星出版社','2022-12-01',252,219,10,'年長牧師在聽取了一位女病人的臨終懺悔后被殺，警方從他身上發現了一張神秘的名單，並發現名單上的人都已去世，死於各種不同的疾病。這一切似乎都指向一個叫灰馬酒店的地方，那裡的三個女巫聲稱可以用魔法令人自然死亡。不信邪的伊斯特布魯克先生決定親自試一試，很快，他最擔心的事情就發生了……'),(9787513338400,'命運之門','阿加莎·克里斯蒂','懸疑推理小說','簡體中文','新星出版社','2022-12-01',252,219,10,'已屆老年的主人公湯米和塔彭絲夫婦在一座老宅子裏發現了一樁塵封多年的案件，通過不懈努力，終於使案情水落石出。'),(9787513344876,'天使的號角','傑夫里·迪弗','懸疑推理小說','簡體中文','新星出版社','2022-12-01',414,360,10,'兇手的下一個攻擊目標是誰？受害者的神秘刺青傳遞了什麼信息？兇手自己的刺青——一張長着女人臉和獠牙的猙獰蜈蚣又有何深意？他的終極任務到底是什麼？隨着調查的深入，萊姆愈發覺得，沒有什麼比陰魂不散的過往更讓人瘋狂……'),(9787513350440,'祈禱之海','格雷格·伊根','科幻奇幻小說','簡體中文','新星出版社','2023-01-01',348,303,10,'人的內在和外部世界一樣是可以用自然科學認知的，觀念、人格、記憶甚至愛都能從物理學深處找到解釋。我們能夠認知一切，只要我們足夠勇敢。'),(9787513350457,'閃耀','陳梓鈞','科幻奇幻小說','簡體中文','新星出版社','2023-01-01',354,308,10,'“太空大航海時代”對遠方的嚮往以及人類在大災難時以科技自救的悲壯抗爭，風格澎湃、肆意、雄渾，充滿理想主義激情與技術的浪漫。'),(9787513352581,'怪獸保護協會','約翰·斯卡爾齊','科幻奇幻小說','簡體中文','新星出版社','2023-10-01',354,308,10,'當我來到一個蓊蓊鬱郁的格陵蘭島，看到小山大小、自成生態系統的奇怪生物漫步在一個沒有人類踏足的大地上，我產生了一種不祥的預感。當我來到一個蓊蓊鬱郁的格陵蘭島，看到小山大小、自成生態系統的奇怪生物漫步在一個沒有人類踏足的大地上，我產生了一種不祥的預感。'),(9787514621518,'同溫層食堂','汪彥中','科幻奇幻小說','簡體中文','中國畫報出版社','2023-04-01',270,235,10,'超過一百二十萬人離開地面，就這麼十幾年、幾十年孤獨地漂浮在同溫層中，他們害怕孤獨，也想念親人，但在同溫層存在的食堂卻能夠給他們快樂……'),(9787514621532,'天地大衝撞','蕭星寒','科幻奇幻小說','簡體中文','中國畫報出版社','2023-04-01',270,235,10,'科技對人性的考驗，帶入讀者深入思考科技對人類、生活帶來的負面影響。'),(9787532967155,'天才與瘋子的狂想','南派三叔','懸疑推理小說','簡體中文','山東文藝出版社','2023-01-01',348,303,10,'“地球是一把鎖”“人體是黑盒子”“有一個外星人在我的腦子裡”，“影子有1829層”“疼痛有14種感覺”，天馬行空、奇思異想，從量子物理到生命存在，為我們呈現了不同角度的世界。'),(9787541162701,'五十分之一','宇航一','懸疑推理小說','簡體中文','四川文藝出版社','2022-11-01',288,251,10,'以杭一為首的幾個同伴聯合起來，希望可以說服超能力者們通力合作，解決問題。然而，死亡遊戲已經開始，背後操控的人不會輕易妥協。'),(9787541166976,'春日偶成','橋上小菩','愛情小說','簡體中文','四川文藝出版社','2023-08-01',257,224,10,'即使荊棘圍困我的城堡，即使女巫使用咒語要我沉睡，即使既定的命運要我遺忘你……可是，如果你呼喚我，我仍會出現。哪怕只有千千萬萬億億分之一的概率，我也會與你，再次相見。'),(9787545572728,'破夜（上下）','北流','懸疑推理小說','簡體中文','天地出版社','2023-03-01',468,407,10,'冷漠理智、不近人情的高智商犯罪顧問秦晉荀，背負著原生家庭的陰影，為了探究一樁陳年舊事來到諸城，結識了滿身都是秘密的女主角溫玉。'),(9787557029128,'危險關係','白雲孤扉','懸疑推理小說','簡體中文','廣東旅遊出版社','2023-01-01',330,287,10,'床笫之間的第三雙眼睛，慘死家中的恩愛夫妻，心懷不軌的猥瑣鄰居，爛尾樓中的懷孕女屍……錯綜複雜的案件關係，意料之外的犯罪動機。熱血女警穆錦和冷面學霸商洛白，“同居”密友攜手勘破重重迷案，解鎖未知危險關係！'),(9787557031411,'浪漫過敏','偷馬頭','愛情小說','簡體中文','廣東旅遊出版社','2023-11-01',257,224,10,'是誰跨越南北，說去看雪，只為看她？漫天煙花炸響，卻把未盡的告白淹沒……相比不切實際的愛情，安念念更相信自己。'),(9787559479037,'今朝渡‧下冊','日日複日日','愛情小說','簡體中文','江蘇鳳凰文藝出版社','2023-10-01',281,281,10,'受天威壓迫千年，他早習以為常。直到遇到聶音之。他願意用命賭一把，打破天道規則，去好好愛她。'),(9787559637949,'盜墓筆記十年','南派三叔','懸疑推理小說','簡體中文','北京聯合出版公司','2019-11-01',276,240,10,'隱秘的七星魯王宮、海底沉船墓，詭異的秦嶺神樹、雲頂天宮，神秘莫測的蛇沼鬼城、陰山古樓，再加上可怖的血屍、駭人的禁婆、要命的奇門遁甲機關陣圖，時時讓人置身險境！'),(9787559664228,'未完成的手稿','弗蘭克·蒂利耶','懸疑推理小說','簡體中文','北京聯合出版公司','2022-10-01',408,355,10,'一具沒有臉的屍體，一部未完成的手稿。法國格勒諾布爾市，一輛汽車在午夜墜入峽谷，後備箱里有一具女屍：整張臉都被撕掉了。四年前，暢銷書女作家琳妮十七歲的女兒突然失蹤；如今丈夫意外失憶，一直苦苦追尋真相的她瀕臨崩潰，而警察一路的抽絲剝繭帶給她的卻是步步殺機……'),(9787559664389,'漫長的寒冬：失落之城','A.G.利德爾','科幻奇幻小說','簡體中文','北京聯合出版公司','2023-02-21',348,303,10,'失蹤的移民、地底的巨型球體、神秘的圖形，它們與網格有何關係？留給人類的時間不多了，末日之戰，一觸即發，宇宙將復歸寂滅，還是重煥生機？'),(9787559666482,'遺忘效應','喬·哈特','科幻奇幻小說','簡體中文','北京聯合出版公司','2023-05-23',354,308,10,'在猶如密室的太空船上，他人的惡意，自己的心魔，哪個更可怕？當所有證據都指向你是凶手，這是他人的陰謀，還是真實的衝動？'),(9787569947441,'銀翼殺手2029（1）：重逢','邁克·約翰遜','科幻奇幻小說','簡體中文','北京時代華文書局','2023-05-01',348,303,10,'當阿什娜與昔日對手，一個被認為已經死去很久的敵人重逢，她被捲入了一場致命的貓捉老鼠的遊戲。這個複製人與她之前遇到過的全都不同——一名不懼怕死亡的複製人，夢想着創造一個新世界……'),(9787572600531,'暗影巡空','阿拉斯泰爾·雷諾茲','科幻奇幻小說','簡體中文','湖南文藝出版社','2023-05-01',408,335,10,'被詛咒的船隻、復仇的公司和外星文明，大膽的逃亡和超出想象的財富，以及痴迷和背叛。'),(9787572603051,'可愛過敏原','稚楚','愛情小說','簡體中文','湖南文藝出版社','2023-09-01',317,276,10,'只有樂知時是命定之外的意外造訪，是驟雨突至。'),(9787573503053,'白鳥與蝙蝠','東野圭吾','懸疑推理小說','簡體中文','南海出版公司','2023-02-22',414,360,10,'善與惡，是與非，罪與罰，邏輯與感性……一切看似對立不相容的事物，在巨大的命運齒輪面前立場反轉，陰陽顛倒，終於合二為一。“光影共存，晝夜同生，宛如白鳥與蝙蝠在空中對舞。'),(9787573611116,'阿南','Twentine','愛情小說','簡體中文','青島出版社','2023-09-01',299,299,10,'縱情者的一生，大夢一場。兩個一無所有、沒有退路的人，跨越貴州、北京，義無反顧地相愛。'),(9787576316629,'星際邊境','喬·霍爾德曼','科幻奇幻小說','簡體中文','北京理工大學出版社','2022-11-01',299,260,10,'卡梅倫花了六年時間乘坐飛船到了一個遙遠的恒星星系，那裡是某個神秘而強大的外星種族的家。卡梅倫希望與對方達成共識以避免戰爭！'),(9789570871500,'人生不能照單全收，買東西也是','南仁淑','心理勵志','繁體中文','聯經出版公司 ','2023-11-30',360,284,10,'真正的消費是，愉快拿金錢交換人生所需的物品，卻不會被支配！'),(9789573340997,'初戀販賣所',' Misa ','愛情小說','繁體中文','黃冠','2024-01-08',320,288,10,'最深的眷戀，全是想念。最美的愛情，都是錯過。蟬聯博客來、金石堂、誠品暢銷排行榜，純戀教主Misa獻給每一個難忘戀情的妳！'),(9789576587047,'好好再見 不負遇見','黃山料','愛情小說','繁體中文','三采','2021-12-30',380,300,10,'在愛裡傷心，不一定是捨不得對方；我們只是，心疼那個受傷失望的自己。即使不能在一起，遇見你，仍是生命裡最好的事情。'),(9789577417800,'愛，或另一種愛','橘子','文學小說','繁體中文','春天出版社','2023-12-01',310,244,10,'大人不可能什麼都要。寂寞大人世界裡的寂寞是這樣:和條件對的人生活著，和把心給了的人錯過了。'),(9789861344812,'罪行','Ferdinand von Schirach','文學小說','繁體中文','先覺','2023-12-01',330,260,10,'很少有人會在早上起床的時候說：「好吧，我今天要犯罪。」但是，每個人都可能犯下罪行。'),(9789861757667,'我，刀槍不入',' David Goggins','心理勵志','繁體中文','方智','2023-11-01',480,379,10,'一名自幼遭家暴、貧窮、因憂鬱暴飲暴食而肥胖、備受歧視，出生似乎就預告失敗的年輕人，卻勇敢翻轉一切，變身美軍兵王、世界頂尖耐力賽運動員，以及激勵全球讀者的超級偶像，寫下這個世紀最勵志、最感人的生命紀錄。'),(9789865068271,'你的親密關係模式，藏著你過去的傷',' 曾少芬','心理勵志','繁體中文','高寶','2023-09-27',400,316,10,'越愛越無力，不是因為愛消失了，而是你們都受傷了。婚姻不是愛情的墳墓，治療在關係中隱隱作痛的傷疤，愛將在柴米油鹽中繼續生長。婚姻裡的問題，其實是內心舊傷引發的症狀。唯有當過去的傷口癒合，關係才能健康。'),(9789865671297,'小王子','Antoine de Saint-Exupéry','文學小說','繁體中文','漫遊者文化','2014-12-30',250,187,10,'在某次的飛行任務失敗中，偶然的與小王子的邂逅。給每一個曾是孩子的大人……'),(9990867329134,'我可能不完美，但我至少不虛偽','語錄控 ','心理勵志','繁體中文','是日創意文化 ','2023-10-16',480,379,10,'我們從故事裡找到了自己的影子，卻也滋潤了我們被社會傷害的心，我們得到共鳴、得到保有良善以及再度面對的勇氣。＿＿＿獻給在社會黑暗面中，仍負傷前行的你＿＿＿');
/*!40000 ALTER TABLE `books` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `cart`
--

DROP TABLE IF EXISTS `cart`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `cart` (
  `ISBN` int NOT NULL,
  PRIMARY KEY (`ISBN`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `cart`
--

LOCK TABLES `cart` WRITE;
/*!40000 ALTER TABLE `cart` DISABLE KEYS */;
/*!40000 ALTER TABLE `cart` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `member_content`
--

DROP TABLE IF EXISTS `member_content`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `member_content` (
  `Name` varchar(15) NOT NULL,
  `Age` int NOT NULL,
  `E-mail` varchar(45) NOT NULL,
  `Phone` int NOT NULL,
  `ID` int NOT NULL,
  `account` varchar(45) NOT NULL,
  `password` varchar(45) NOT NULL,
  PRIMARY KEY (`Name`,`Age`,`E-mail`,`Phone`,`ID`,`password`,`account`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `member_content`
--

LOCK TABLES `member_content` WRITE;
/*!40000 ALTER TABLE `member_content` DISABLE KEYS */;
INSERT INTO `member_content` VALUES ('Lina',78,'fiefij@gmail.com',1589885222,0,'',''),('SFE',88,'deefe@gmail.com',846148456,1,'',''),('昌宇',20,'ryanchung50107@gmail.com',905195792,2,'','');
/*!40000 ALTER TABLE `member_content` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `order`
--

DROP TABLE IF EXISTS `order`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `order` (
  `address` varchar(160) NOT NULL,
  PRIMARY KEY (`address`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `order`
--

LOCK TABLES `order` WRITE;
/*!40000 ALTER TABLE `order` DISABLE KEYS */;
/*!40000 ALTER TABLE `order` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2024-01-02 21:19:16
